Repository: pypi-data/pypi-mirror-47
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.1.2-py3-none-any.whl/redbot/cogs/cleanup/locales/*.po
Languages: fr_fr, ru_ru, tr_tr

source: Commands for cleaning up messages.
fr_fr: Commandes pour supprimer des messages.
ru_ru: Команды для очистки сообщений.
tr_tr: İletileri temizleme için komutları.

source: Are you sure you want to delete {number} messages? (y/n)
fr_fr: Êtes vous sûr de supprimer {number} messages ? (o/n)
ru_ru: Вы уверены, что хотите удалить {number} сообщений? (y/n)
tr_tr: {number} iletileri silmek istediğinizden emin misiniz? (e/h)

source: Cancelled.
fr_fr: Annulé.
ru_ru: Отменено.
tr_tr: İptal.

source: Delete messages.
fr_fr: Supprime les messages.
ru_ru: Удалить сообщения.
tr_tr: Mesajları sil.

source: Delete the last X messages matching the specified text. Example: `[p]cleanup text "test" 5` Remember to use double quotes.
fr_fr: Supprime les X derniers messages correspondant au texte spécifié. Exemple : `[p]cleanup text "test" 5` N'oubliez pas d'utiliser des guillemets.
ru_ru: Удалить последние X сообщений, соответствующие указанному тексту. Пример: `[p]cleanup text "test" 5` Не забывайте использовать двойные кавычки.
tr_tr: Belirtilen metin eşleştirme mesajları Sil son X. örnek: <div class="notranslate"> '2</div>, temizleme metin "test" 5' çift tırnak işaretleri kullanmak için anımsa.

source: Delete the last X messages from a specified user. Examples: `[p]cleanup user @​Twentysix 2` `[p]cleanup user Red 6`
fr_fr: Supprime les X derniers messages d'un utilisateur spécifié. Exemples : `[p]cleanup user @​Twentysix 2` `[p]cleanup user Red 6`
ru_ru: Удалить последние X сообщений от указанного пользователя. Примеры: `[p]cleanup user @​Twentysix 2` `[p]cleanup user Red 6`
tr_tr: Son X iletileri belirtilen bir kullanıcının bağlantısını sil. örnekler: '[p]Temizleme Kullanıcı @ yaklaştın 2' '[p]Temizleme Kullanıcı kırmızı 6' < div class = "notr anslate "> 5</div>

source: Delete all messages after a specified message. To get a message id, enable developer mode in Discord's settings, 'appearance' tab. Then right click a message and copy its id.
fr_fr: Supprimer tous les messages après un message spécifié. Pour obtenir l'Id d'un message, activez le mode dévoloppeur dans l'onglet "Apparence" des paramètres de Discord. Ensuite faites clic droit sur un message et "Copier l'identifiant".
ru_ru: Удалить все сообщения после указанного сообщения. Чтобы получить Id сообщения, включите режим разработчика в настройках Discord, во вкладке 'Внешний вид'. Затем щелкните правой кнопкой мыши на сообщение и скопируйте его Id.
tr_tr: Tüm iletileri sonra belirtilen ileti silme. bir ileti kimliği almak için anlaşmazlık'ın ayarları, 'Görünüm' sekmesi Geliştirici modunu etkinleştirin. O zaman doğru tıkırtı bir ileti ve onun kimliğini kopyalayın.

source: Message not found.
fr_fr: Message introuvable.
ru_ru: Сообщение не найдено.
tr_tr: Mesaj bulunamadı.

source: Deletes X messages before specified message. To get a message id, enable developer mode in Discord's settings, 'appearance' tab. Then right click a message and copy its id.
fr_fr: Supprime X messages avant un message spécifié. Pour obtenir l'Id d'un message, activez le mode dévoloppeur dans l'onglet "Apparence" des paramètres de Discord. Ensuite faites clic droit sur un message et "Copier l'identifiant".
ru_ru: Удалить X сообщений перед указанным сообщением. Чтобы получить Id сообщения, включите режим разработчика в настройках Discord, во вкладке 'Внешний вид'. Затем щелкните правой кнопкой мыши на сообщение и скопируйте его Id.
tr_tr: Belirtilen ileti önce siler X iletileri. bir ileti kimliği almak için anlaşmazlık'ın ayarları, 'Görünüm' sekmesi Geliştirici modunu etkinleştirin. O zaman doğru tıkırtı bir ileti ve onun kimliğini kopyalayın.

source: Delete the last X messages. Example: `[p]cleanup messages 26`
fr_fr: Supprime les X derniers messages. Exemple : `[p]cleanup messages 26`
ru_ru: Удалить последние X сообщений. Пример: `[p]cleanup messages 26`
tr_tr: Mesajları sil son X. örnek: <div class="notranslate"> '2</div> Temizleme 26 mesajları'

source: Clean up command messages and messages from the bot.
fr_fr: Supprime les messages de commandes et les messages venant du bot.
ru_ru: Очистить командные сообщения и сообщения от бота.
tr_tr: Komut mesajlarını ve mesajları bottan temizleyin.

source: Clean up messages owned by the bot. By default, all messages are cleaned. If a third argument is specified, it is used for pattern matching: If it begins with r( and ends with ), then it is interpreted as a regex, and messages that match it are deleted. Otherwise, it is used in a simple substring test. Some helpful regex flags to include in your pattern: Dots match newlines: (?s); Ignore case: (?i); Both: (?si)
fr_fr: Supprimer les messages appartenant au bot. Par défaut, tous les messages sont supprimés. Si un troisième argument est spécifié, il est utilisé pour la comparaison de motifs : S'il commence par r( et se termine par ), alors il est interprété comme un regex, et les messages qui y correspondent sont les suivants effacé. Sinon, il est utilisé dans un simple test de sous-chaîne. Quelques drapeaux de regex utiles à inclure dans votre motif : Les points correspondent aux nouvelles lignes : (?s) ; Ignorer le cas : (?i) ; Les deux : (?si)
ru_ru: Очистить сообщения, принадлежащие боту. По умолчанию очищаются все сообщения. Если указан третий аргумент, он используется для сопоставления с образцом: если он начинается с r (и заканчивается), то он интерпретируется как регулярное выражение, и соответствующие ему сообщения удаляются. В противном случае он используется в простом тесте подстроки. Некоторые полезные флаги регулярных выражений для включения в ваш шаблон: Точки соответствуют символам новой строки: (?s); Игнорировать случай: (?i); Оба: (?si)
tr_tr: Bot tarafından sahip olunan mesajları temizleyin. Varsayılan olarak, tüm mesajlar temizlenir. Üçüncü bir argüman belirtilmişse, desen eşleşmesi için kullanılır: Eğer r ile başlarsa (ve ile biterse), o zaman bir regex olarak yorumlanır ve onunla eşleşen mesajlar silindi. Aksi halde, basit bir alt dizgi testinde kullanılır. Desene dahil etmek için bazı yararlı normal ifadeler: Noktalar yeni satırlarla eşleşir: (? S); Yoksay: (? İ); İkisi de: (? Si)
