Repository: pypi-data/pypi-mirror-47
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.1.2-py3-none-any.whl/redbot/cogs/customcom/locales/*.po
Languages: ru_ru

source: Welcome to the interactive random {cc} maker! Every message you send will be added as one of the random responses to choose from once this {cc} is triggered. To exit this interactive menu, type `{quit}`
ru_ru: Добро пожаловать в интерактивную программу случайных {cc}! Каждое отправленное вами сообщение будет добавлено в качестве одного из случайных ответов на выбор после запуска {cc}. Чтобы выйти из этого интерактивного меню, введите `{quit}`

source: Add a random response:
ru_ru: Добавить случайный ответ:

source: Random responses must take the same arguments!
ru_ru: Случайные ответы должны принимать те же аргументы!

source: Do you want to create a 'randomized' custom command? (y/n)
ru_ru: Вы хотите создать 'произвольную' пользовательскую команду? (y/n)

source: Response timed out, please try again later.
ru_ru: Время ответа истекло, повторите попытку позже.

source: What response do you want?
ru_ru: Какой ответ вы хотите?

source: Creates commands used to display text.
ru_ru: Создает команды, используемые для отображения текста.

source: Custom commands management.
ru_ru: Управление пользовательскими командами.

source: Create custom commands. CCs can be enhanced with arguments, see the guide [here](https://red-discordbot.readthedocs.io/en/v3-develop/cog_customcom.html).
ru_ru: Создать пользовательские команды. ПК могут быть дополнены аргументами, см. руководство [здесь](https://red-discordbot.readthedocs.io/en/v3-develop/cog_customcom.html).

source: Create a CC where it will randomly choose a response! Note: This command is interactive.
ru_ru: Создать пользовательскую команду, в которой она будет случайным образом выбирать ответ! Примечание: Эта команда является интерактивной.

source: Custom command successfully added.
ru_ru: Пользовательская команда успешно добавлена.

source: This command already exists. Use `{command}` to edit it.
ru_ru: Эта команда уже существует. Используйте `{command}` для редактирования.

source: Add a simple custom command. Example: - `[p]customcom create simple yourcommand Text you want`
ru_ru: Добавить простую пользовательскую команду. Пример: - `[p]customcom create simple yourcommand Text you want`

source: There already exists a bot command with the same name.
ru_ru: Уже существует команда бота с таким же именем.

source: Set, edit, or view the cooldown for a custom command. You may set cooldowns per member, channel, or guild. Multiple cooldowns may be set. All cooldowns must be cooled to call the custom command. Example: - `[p]customcom cooldown yourcommand 30`
ru_ru: Установить, отредактировать или просмотреть время восстановления для пользовательской команды. Вы можете установить время восстановления для каждого участника, канала или гильдии. Можно установить несколько перезарядок. Все перезарядки должны быть сброшены, чтобы вызвать пользовательскую команду. Пример: - `[p]customcom cooldown yourcommand 30`

source: That command doesn't exist.
ru_ru: Такой команды не существует.

source: A {} may call this command every {} seconds
ru_ru: {} может вызывать эту команду каждые {} секунд

source: This command has no cooldown.
ru_ru: Эта команда не имеет времени восстановления.

source: {} must be one of {}
ru_ru: {} должен быть одним из {}

source: Custom command cooldown successfully edited.
ru_ru: Время восстановления пользовательской команды успешно отредактировано.

source: That command doesn't exist. Use `{command}` to add it.
ru_ru: Эта команда не существует. Используйте `{command}`, чтобы добавить ее.

source: Delete a custom command . Example: - `[p]customcom delete yourcommand`
ru_ru: Удалить пользовательскую команду . Пример: - `[p]customcom delete yourcommand`

source: Custom command successfully deleted.
ru_ru: Пользовательская команда успешно удалена.

source: Edit a custom command. Example: - `[p]customcom edit yourcommand Text you want`
ru_ru: Редактировать пользовательскую команду. Пример: - `[p]customcom edit yourcommand Text you want`

source: Custom command successfully edited.
ru_ru: Пользовательская команда успешно отредактирована.

source: List all available custom commands. The list displays a preview of each command's response, with markdown escaped and newlines replaced with spaces.
ru_ru: Список всех доступных пользовательских команд. В списке отображается предварительный просмотр ответа каждой команды, с экранированной уценкой и символами новой строки, замененными пробелами.

source: There are no custom commands in this server. Use `{command}` to start adding some.
ru_ru: На этом сервере нет пользовательских команд. Используйте `{command}`, чтобы начать добавлять некоторые.

source: Custom Command List
ru_ru: Список пользовательских команд

source: Page {num}/{total}
ru_ru: Страница {num}/{total}

source: Too many arguments!
ru_ru: Слишком много аргументов!

source: Arguments must be sequential. Missing arguments:
ru_ru: Аргументы должны быть последовательными. Отсутствующие аргументы:

source: Conflicting colon notation for argument {index}: "{name1}" and "{name2}".
ru_ru: Противоречивая запись двоеточия для аргумента {index}: "{name1}" и "{name2}".
