Repository: pypi-data/pypi-mirror-47
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.1.2.tar.gz/Red-DiscordBot-3.1.2/redbot/cogs/downloader/locales/*.po
Languages: ru_ru, tr_tr

source: You're about to add a 3rd party repository. The creator of Red and its community have no responsibility for any potential damage that the content of 3rd party repositories might cause. By typing '**I agree**' you declare that you have read and fully understand the above message. This message won't be shown again until the next reboot. You have **30** seconds to reply to this message.
ru_ru: Вы собираетесь добавить сторонней репозиторий. Создатель Red и его сообщество не несут ответственности за любой потенциальный ущерб, который может нанести содержимое сторонних репозиториев. Набирая **I agree**, вы подтверждаете, что прочитали и полностью поняли приведенное выше сообщение. Это сообщение больше не будет отображаться до следующей перезагрузки. У вас есть **30** секунд, чтобы ответить на это сообщение.
tr_tr: Yaklaşık 3 parti depo eklemek üzeresiniz. Kırmızı ve onun topluluk yaratıcısı 3 parti depoları içeriği neden olabilecek herhangi bir potansiyel hasar için hiçbir sorumluluk var. yazarak ' ** ben katılıyorum **' okuduğunuzu ve yukarıdaki mesajı tam olarak anlamak ilan ediyorum. Bu iletiyi bir daha sonraki yeniden başlatılıncaya kadar gösterilmeyecektir. sen-si olmak ** 30 ** saniye bu iletiyi yanıtlayın.

source: Your response has timed out, please try again.
ru_ru: Время ответа превышено, пожалуйста, попробуйте еще раз.
tr_tr: Oturumunuz zaman aşımına uğradı. Lütfen tekrar giriş yapın.

source: No Downloader cog found.
ru_ru: Плагин Downloader не найден.
tr_tr: İndirici bulunamadı.

source: That cog is not installed
ru_ru: Этот плагин не установлен
tr_tr: Bu uygulama yüklü değil

source: Install a group of dependencies using pip.
ru_ru: Установите группу зависимостей, используя pip.
tr_tr: Pip kullanarak bir grup bağımlılık kurun.

source: Libraries installed.
ru_ru: Библиотеки установлены.
tr_tr: Kütüphaneler yüklü.

source: Some libraries failed to install. Please check your logs for a complete list.
ru_ru: Не удалось установить некоторые библиотеки. Пожалуйста, проверьте ваши записи для получения полного списка.
tr_tr: Bazı kütüphaneler yüklenemedi. Lütfen eksiksiz bir liste için kayıtlarınızı kontrol edin.

source: Repo management commands.
ru_ru: Команды управления репозиторием.
tr_tr: Repo yönetimi komutları.

source: Add a new repo. The name can only contain characters A-z, numbers and underscores. The branch will be the default branch if not specified.
ru_ru: Добавить новый репозиторий Имя может содержать только символы A-z, цифры и подчеркивания. Ветвь будет ветвью по умолчанию, если она не указана.
tr_tr: Yeni bir repo ekleyin. ad yalnızca A-z, sayı ve alt çizgi karakterleri içerebilir. şube varsayılan dalı olacaktır aksi takdirde belirtilen.

source: That git repo has already been added under another name.
ru_ru: Этот репозиторий уже был добавлен под другим именем.
tr_tr: Bu git repo zaten başka bir isim altında eklendi.

source: Something went wrong during the cloning process.
ru_ru: Что-то пошло не так во время клонирования.
tr_tr: Klonlama işlemi sırasında bir şeyler ters gitti.

source: Repo `{name}` successfully added.
ru_ru: Репозиторий `{name}` успешно добавлен.
tr_tr: Repo ' başarıyla eklendi{name}'.

source: Remove a repo and its files.
ru_ru: Удалить репозиторий и его файлы.
tr_tr: Bir repo ve dosyalarını kaldırın.

source: The repo `{repo.name}` has been deleted successfully.
ru_ru: Репозиторий `{repo.name}` был успешно удален.
tr_tr: Repo '{repo.name}' başarıyla silindi.

source: List all installed repos.
ru_ru: Список всех установленных репозиториев.
tr_tr: Tüm yüklü repos listelenmektedir.

source: Installed Repos:
ru_ru: Установленные репозитории:
tr_tr: Yüklü Repos:

source: Show information about a repo.
ru_ru: Показать информацию о репозитории.
tr_tr: Bir repo ilgili bilgileri gösterir.

source: Repo `{repo.name}` not found.
ru_ru: Репозиторий `{repo.name}` не найден.
tr_tr: Repo ' bulunamadı{repo.name}'.

source: Information on {repo.name}: {description}
ru_ru: Информация о {repo.name}: {description}
tr_tr: {repo.name}hakkında bilgi: {description}

source: Cog installation management commands.
ru_ru: Команды управления установкой плагина.
tr_tr: Cog yükleme yönetimi komutları.

source: Install a cog from the given repo.
ru_ru: Установить плагин из данного репозитория.
tr_tr: Bir dişli verilen repo yükleyin.

source: Error: there is no cog by the name of `{cog_name}` in the `{repo.name}` repo.
ru_ru: Ошибка: в репозитории `{repo.name}` нет плагина с именем `{cog_name}`.
tr_tr: Hata: '{cog_name}' '{repo.name}' repo adını tarafından hiçbir cog işte.

source: This cog requires at least python version {version}, aborting install.
ru_ru: Этот плагин требует как минимум версию Python {version}, прерывая установку.
tr_tr: Bu dişli en az gerektirir python sürüm {version} yükleme durduruluyor,.

source: Failed to install the required libraries for `{cog_name}`: `{libraries}`
ru_ru: Не удалось установить необходимые библиотеки для `{cog_name}`: `{libraries}`
tr_tr: Gerekli kitaplıklar için '{cog_name}' yükleme başarısız oldu: '{libraries} '

source: Cog `{cog_name}` successfully installed.
ru_ru: Плагин `{cog_name}` успешно установлен.
tr_tr: COG ' başarıyla yüklendi{cog_name}'.

source: Uninstall a cog. You may only uninstall cogs which were previously installed by Downloader.
ru_ru: Удалить плагин. Вы можете удалить только те плагины, которые были ранее установлены с помощью Downloader.
tr_tr: Bir cog kaldırın. sadece önceden yüklenmiş Downloader tarafından olan Smm kaldırabilirsiniz.

source: Cog `{cog_name}` was successfully uninstalled.
ru_ru: Плагин `{cog_name}` был успешно удален.
tr_tr: Cog '{cog_name}' başarıyla kaldırıldı.

source: That cog was installed but can no longer be located. You may need to remove it's files manually if it is still usable. Also make sure you've unloaded the cog with `{prefix}unload {cog_name}`.
ru_ru: Этот плагин был установлен, но больше не может быть найден. Возможно, вам придется удалить его файлы вручную, если он еще используется. Также убедитесь, что вы выгружали плагин с помощью `{prefix}unload {cog_name}`.
tr_tr: O cog yüklendi ancak artık bulunabilir. Yine de kullanışlı ise bu dosyaları el ile kaldırmanız gerekebilir. Ayrıca <div class="notranslate"> '0</div> kaldırma ile <div class="notranslate"> 1'</div> cog bellekten kaldırılan emin olun.

source: Update all cogs, or one of your choosing.
ru_ru: Обновить все плагины или один на ваш выбор.
tr_tr: Bütün çarkları, ya da sizin seçtiğiniz birini güncelleştirin.

source: Cog update completed successfully.
ru_ru: Обновление плагина завершено успешно.
tr_tr: Cog güncelleştirme başarıyla tamamlandı.

source: Updated:
ru_ru: Обновлено:
tr_tr: Güncelleme:

source: All installed cogs are already up to date.
ru_ru: Все установленные плагины уже обновлены.
tr_tr: Tüm yüklü çarkları vardır zaten güncel.

source: None of the updated cogs were previously loaded. Update complete.
ru_ru: Ни один из обновленных плагинов не был загружен ранее. Обновление завершено.
tr_tr: Güncellenen çarkların hiçbiri daha önce yüklenmedi. Güncelleme tamamlandı.

source: Would you like to reload the updated cogs?
ru_ru: Вы хотите перезагрузить обновленные плагины?
tr_tr: Veriyi yeniden göndermek istiyor musun?

source: OK then.
ru_ru: Хорошо, тогда.
tr_tr: Tamam o zaman.

source: List all available cogs from a single repo.
ru_ru: Список всех доступных плагинов из одного репозитория.
tr_tr: Tüm kullanılabilir Smm üzerinden tek bir repo listelenmektedir.

source: Installed Cogs:
ru_ru: Установленные плагины:
tr_tr: Yüklü Smm:

source: Available Cogs:
ru_ru: Доступные плагины:
tr_tr: Kullanılabilir Smm:

source: List information about a single cog.
ru_ru: Список информации об одном плагине.
tr_tr: Tek bir cog hakkında bilgi listesi.

source: There is no cog `{cog_name}` in the repo `{repo.name}`
ru_ru: В репозитории `{repo.name}` нет плагина `{cog_name}`
tr_tr: Repo '{repo.name} ' hiçbir cog '{cog_name}' olduğunu

source: Information on {cog_name}: {description} Requirements: {requirements}
ru_ru: Информация о {cog_name}: {description} Требования: {requirements}

source: Missing from info.json
ru_ru: Нет информации в info.json

source: Missing from installed repos
ru_ru: Отсутствует из установленных репозиториев

source: Command: {command} Made by: {author} Repo: {repo} Cog name: {cog}
ru_ru: Команда: {command} Автор: {author} Репозиторий: {repo} Имя плагина: {cog}

source: Find which cog a command comes from. This will only work with loaded cogs.
ru_ru: Найдите, из какого плагина поступает команда. Это будет работать только с загруженными плагинами.
tr_tr: Hangi bir komut cog bul gelir. bu-ecek biricik iş ile yüklenen teneke adam.

source: That command doesn't seem to exist.
ru_ru: Такой команды не существует.
tr_tr: Bu komut var gibi görünmüyor.

source: Repo by the name "{repo_name}" does not exist.
ru_ru: Репозиторий с именем "{repo_name}" не существует.
tr_tr: Repo adı <div class="notranslate"> 0"</div> yok.
