Repository: pypi-data/pypi-mirror-47
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.1.2.tar.gz/Red-DiscordBot-3.1.2/redbot/cogs/image/locales/*.po
Languages: nl_nl

source: Image related commands.
nl_nl: Beeld gerelateerde commando's.

source: Retrieve pictures from Imgur. Make sure to set the Client ID using `[p]imgurcreds`.
nl_nl: Ophalen van foto's van Imgur. Zorg ervoor dat u de Client-ID instelt met `[p] imgurrissen`.

source: Search Imgur for the specified term. Returns up to 3 results.
nl_nl: Zoek in Imgur voor de opgegeven termijn. Retourneert maximaal 3 resultaten.

source: A Client ID has not been set! Please set one with `{prefix}imgurcreds`.
nl_nl: Er is geen client-ID ingesteld! Stel een een in met `{prefix} imgurcreds`.

source: Your search returned no results.
nl_nl: Je zoekopdracht leverde geen resultaten op.

source: Search results...
nl_nl: Zoekresultaten...

source: Something went wrong. Error code is {code}.
nl_nl: Er is iets fout gegaan. Foutcode is {code}.

source: Get images from a subreddit. You can customize the search with the following options: - `<sort_type>`: new, top - `<window>`: day, week, month, year, all
nl_nl: Download afbeeldingen van een subreddit. Je kunt de zoekopdracht aanpassen met de volgende opties: - `<sort_type>`: nieuw, bovenaan - `<window>`: dag, week, maand, jaar, alles

source: Only 'new' and 'top' are a valid sort type.
nl_nl: Alleen `new` en `top` zijn geldige sorteertypes.

source: No results found.
nl_nl: Geen resultaten gevonden.

source: Set the Imgur Client ID. To get an Imgur Client ID: 1. Login to an Imgur account. 2. Visit [this](https://api.imgur.com/oauth2/addclient) page 3. Enter a name for your application 4. Select *Anonymous usage without user authorization* for the auth type 5. Set the authorization callback URL to `https://localhost` 6. Leave the app website blank 7. Enter a valid email address and a description 8. Check the captcha box and click next 9. Your Client ID will be on the next page.
nl_nl: Stel de Imgur Client-ID in. Om een ​​Imgur Client-ID te krijgen: 1. Log in op een Imgur-account. 2. Ga naar [this] (https://api.imgur.com/oauth2/addclient) pagina 3. Voer een naam in voor uw toepassing 4. Selecteer * Anoniem gebruik zonder toestemming van de gebruiker * voor het auth-type 5. Stel de autorisatie-callback in URL naar `https: // localhost` 6. Laat de app-website leeg 7. Voer een geldig e-mailadres en een beschrijving in 8. Vink het vakje captcha aan en klik op volgend 9. Je klant-ID staat op de volgende pagina.

source: The Imgur Client ID has been set!
nl_nl: De Imgur Client ID is ingesteld!

source: Retrieve the first search result from Giphy.
nl_nl: Haal het eerste zoekresultaat op van Giphy.

source: Error contacting the Giphy API.
nl_nl: Fout bij het contacteren van de Giphy API.

source: Retrieve a random GIF from a Giphy search.
nl_nl: Haal een willekeurige GIF op uit een Giphy-zoekopdracht.

source: Error contacting the API.
nl_nl: Fout bij het contacteren van de API.
