Repository: pypi-data/pypi-mirror-47
Catalog: packages/collective.tiles.advancedstatic/collective.tiles.advancedstatic-1.1.0.tar.gz/collective.tiles.advancedstatic-1.1.0/src/collective/tiles/advancedstatic/locales/*/LC_MESSAGES/collective.tiles.advancedstatic.po
Languages: it

source: A tile that show static text
it: Una tile che mostra testo statico

source: Add this tile to mosaic list.
it: Aggiungi questa tile alla lista mosaic.

source: Advanced Static tile
it: Tile statica avanzata

source: Advanced Static tile (mosaic support)
it: Tile statica avanzata (supporto per mosaic)

source: Advanced Static tile (uninstall)
it: Tile statica avanzata (disinstalla)

source: Advanced static tile
it: Tile statica avanzata

source: Installs the collective.tiles.advancedstatic add-on.
it: Installa l'add-on collective.tiles.advancedstatic

source: Uninstalls the collective.tiles.advancedstatic add-on.
it: Disinstalla l'add-on collective.tiles.advancedstatic

source: help_image_ref
it: Inserisci una immagine che verrà mostrata come sfondo del titolo

source: help_image_ref_height
it: Specifica l'altezza dell'immagine in background (in pixel). Se è vuoto verrà utilizzata l'altezza dell'immagine.

source: help_internal_url
it: Inserisci un link interno. Questo campo sovrascrive il campo link esterno.

source: help_target_attr
it: Spunta questo box se vuoi che i link presenti nell'header e nel footer vengano aperti in una nuova finestra

source: help_tile_class
it: Classe CSS che viene aggiunta alla tile

source: help_tile_morelink
it: Se presente, l'header e il footer saranno link che portano a questo URL

source: help_tile_style
it: Scegli uno stile personalizzato per questa tile

source: help_tile_text
it: Inserisci del testo formattato

source: label_image_ref
it: Immagine di sfondo

source: label_image_ref_height
it: Altezza dell'immagine di sfondo

source: label_internal_url
it: Link interno

source: label_target_attr
it: Apri i link in una nuova finestra

source: label_tile_class
it: Classi della tile

source: label_tile_footer
it: Footer della tile

source: label_tile_morelink
it: Link per approfondimento

source: label_tile_style
it: Stile della tile

source: label_tile_text
it: Testo della tile

source: label_tile_title
it: Titolo della tile
