Repository: pypi-data/pypi-mirror-47
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.1.2-py3-none-any.whl/redbot/cogs/downloader/locales/*.po
Languages: nl_nl

source: You're about to add a 3rd party repository. The creator of Red and its community have no responsibility for any potential damage that the content of 3rd party repositories might cause. By typing '**I agree**' you declare that you have read and fully understand the above message. This message won't be shown again until the next reboot. You have **30** seconds to reply to this message.
nl_nl: Je staat op het punt een 3rd party repository toe te voegen. De makers en zijn community zijn niet verantwoordelijk voor mogelijke schade die de inhoud van de opslagplaatsen van derden kan veroorzaken. Door '** Ik ga akkoord **' in te tikken, verklaar je dat je het bovenstaande bericht hebt gelezen en volledig begrijpt. Dit bericht zal niet opnieuw worden getoond tot het volgende opnieuw opstart. Je hebt ** 30 ** seconden om dit bericht te beantwoorden.

source: Your response has timed out, please try again.
nl_nl: Je reactie is verlopen, probeer het opnieuw.

source: No Downloader cog found.
nl_nl: Geen Downloader cog gevonden.

source: That cog is not installed
nl_nl: Die cog is niet geïnstalleerd

source: Install a group of dependencies using pip.
nl_nl: Installeer een aantal afhankelijkheden met behulp van pip.

source: Libraries installed.
nl_nl: Bibliotheken geïnstalleerd.

source: Some libraries failed to install. Please check your logs for a complete list.
nl_nl: De installatie van sommige bibliotheken zijn mislukt. Gelieve de logs te checken voor een volledige lijst.

source: Repo management commands.
nl_nl: Repo beheeropdrachten.

source: Add a new repo. The name can only contain characters A-z, numbers and underscores. The branch will be the default branch if not specified.
nl_nl: Voeg een nieuwe repo toe. De naam mag alleen tekens A-z, cijfers en onderstrepingstekens bevatten. De vertakking wordt de standaardtak als deze niet is opgegeven.

source: That git repo has already been added under another name.
nl_nl: Deze git repo is al toegevoegd onder een andere naam.

source: Something went wrong during the cloning process.
nl_nl: Er ging iets fout tijdens het klonen.

source: Repo `{name}` successfully added.
nl_nl: Repo `{name}` succesvol toegevoegd.

source: Remove a repo and its files.
nl_nl: Verwijder een repo en zijn bestanden.

source: The repo `{repo.name}` has been deleted successfully.
nl_nl: De repo `{repo.name}` is succesvol verwijderd.

source: List all installed repos.
nl_nl: Maak een lijst van alle geïnstalleerde repo's.

source: Installed Repos:
nl_nl: Geïnstalleerde repos:

source: Show information about a repo.
nl_nl: Informatie over een repo weergeven.

source: Repo `{repo.name}` not found.
nl_nl: Repo `{repo.name}` niet gevonden.

source: Information on {repo.name}: {description}
nl_nl: Informatie over {repo.name}: {description}

source: Cog installation management commands.
nl_nl: Cog installatie management command's.

source: Install a cog from the given repo.
nl_nl: Installeer een Cog van de gegeven repo.

source: Error: there is no cog by the name of `{cog_name}` in the `{repo.name}` repo.
nl_nl: Fout: er is geen Cog met de naam `{cog_name}` in de repo `{repo.name}`.

source: This cog requires at least python version {version}, aborting install.
nl_nl: Voor deze cog is ten minste python-versie {version} vereist, waardoor installatie wordt geannuleerd.

source: Failed to install the required libraries for `{cog_name}`: `{libraries}`
nl_nl: Installatie van de benodigde bibliotheken is mislukt voor `{cog_name}`: `{libraries}`

source: Cog `{cog_name}` successfully installed.
nl_nl: Cog `{cog_name}` succesvol geïnstalleerd.

source: Uninstall a cog. You may only uninstall cogs which were previously installed by Downloader.
nl_nl: Verwijder een cog. U kunt alleen de cog verwijderen die eerder door Downloader zijn geïnstalleerd.

source: Cog `{cog_name}` was successfully uninstalled.
nl_nl: Cog `{cog_name}` is succesvol verwijderd.

source: That cog was installed but can no longer be located. You may need to remove it's files manually if it is still usable. Also make sure you've unloaded the cog with `{prefix}unload {cog_name}`.
nl_nl: De cog was geïnstalleerd, maar kan niet langer worden gevonden. U moet mogelijk de bestanden handmatig verwijderen als deze nog bruikbaar is. Zorg er ook voor dat je de cog hebt unloaded met `{prefix}unload {cog_name}`.

source: Update all cogs, or one of your choosing.
nl_nl: Werk alle cogs bij, of een van uw keuze.

source: Cog update completed successfully.
nl_nl: Cog update succesvol.

source: Updated:
nl_nl: Geüpdatet:

source: All installed cogs are already up to date.
nl_nl: Alle geïnstalleerde cogs zijn al bijgewerkt.

source: None of the updated cogs were previously loaded. Update complete.
nl_nl: Geen van de geüpdatet cogs zijn eerder geladen. Update is compleet.

source: Would you like to reload the updated cogs?
nl_nl: Wil je de bijgewerkte cogs herladen?

source: OK then.
nl_nl: Ohke.

source: List all available cogs from a single repo.
nl_nl: Alle beschikbare cogs van een enkele repo.

source: Installed Cogs:
nl_nl: Geïnstalleerde Cogs:

source: Available Cogs:
nl_nl: Beschikbare Cogs:

source: List information about a single cog.
nl_nl: Informatie weergeven over een enkele Cog.

source: There is no cog `{cog_name}` in the repo `{repo.name}`
nl_nl: Er is geen cog '{cog_name}' in repo '{repo.name} '

source: Information on {cog_name}: {description} Requirements: {requirements}
nl_nl: Informatie over {cog_name}: {description} Eisen: {requirements}

source: Missing from info.json
nl_nl: Niet gevonden in info.json

source: Command: {command} Made by: {author} Repo: {repo} Cog name: {cog}
nl_nl: Opdracht: {command} Gemaakt door: {author} Repo: {repo} Cog naam: {cog}

source: Find which cog a command comes from. This will only work with loaded cogs.
nl_nl: Zoek uit van welke cog een commando is. Dit werkt alleen met geladen cogs.

source: That command doesn't seem to exist.
nl_nl: Commando bestaat niet.

source: Repo by the name "{repo_name}" does not exist.
nl_nl: Repo met de naam "{repo_name}" bestaat niet.
