Repository: pypi-data/pypi-mirror-47
Catalog: packages/django-script-pattern/django-script-pattern-0.3.3.tar.gz/django-script-pattern-0.3.3/script_pattern/locale/*/LC_MESSAGES/django.po
Languages: ru

# script_pattern
source: Url patterns
ru: Url шаблоны

source: Script pattern
ru: Script шаблоны

# script_pattern
source: Top
ru: Вверху

# script_pattern
source: Bottom
ru: Внизу

# script_pattern
source: Pattern
ru: Шаблон

# script_pattern
source: Case-sensitive. A missing trailing slash does also match to files which start with the name of the pattern, e.g., '/admin' matches '/admin.html' too. Also pattern allow an asterisk (*) as a wildcard and a dollar sign ($) to match the end of the URL, e.g., '/*.jpg$'.
ru: Чувствително к регистру. Утеряный слеш в конце также включает файлы, которые начинаются шаблоном, например, '/admin' также соответствует '/admin.html'. Таже шаблон поддерживает звездочку (*) в качестве подстановки и знак доллара ($) для обозначения конца URL, например, '/*.jpg$'.

# script_pattern
source: Script url
ru: Скриптовый Url

# script_pattern
source: Script urls
ru: Скриптовые Url

# script_pattern
source: Name
ru: Навзвание

# script_pattern
source: Is active
ru: Активный

# script_pattern
source: Tag
ru: Тег

# script_pattern
source: Position
ru: Расположение

# script_pattern
source: Script
ru: Скрипт

# script_pattern
source: Allowed
ru: Разрешенные

# script_pattern
source: The URLs which are allowed to include script block.
ru: Url адреса разрешающие включение блока

# script_pattern
source: Disallowed
ru: Запрещенные

# script_pattern
source: The URLs which are not allowed to include script block.
ru: Url адреса запрещающие включение блока

# script_pattern
source: Script block
ru: Скриптовый блок

# script_pattern
source: Script blocks
ru: Скриптовые блоки
