Repository: pypi-data/pypi-mirror-47
Catalog: packages/coolsignup/coolsignup-0.1.0.tar.gz/coolsignup-0.1.0/coolsignup/locale/*/LC_MESSAGES/coolsignup.po
Languages: fr

source: Hello, please follow this link to confirm your email address and register at {serviceName}: {url} See you in a minute!
fr: Bonjour, suivez ce lien pour confirmer votre adresse e-mail et vous inscrire sur {serviceName}: {url} A tout de suite!

source: Hello, you asked to change the email address associated with your account. Please follow this link to confirm your new email address: {url}
fr: Bonjour, vous avez demandé à changer l'adresse e-mail associée à votre compte. Suivez ce lien pour confirmer votre nouvelle adresse e-mail: {url}

source: Hello, you asked to reset your password at {serviceName}. To set a new password, follow this link: {url}
fr: Bonjour, vous avez demandé à réinitialiser votre mot de passe {serviceName}. Pour définir un nouveau mot de passe, suivez ce lien: {url}

source: Incorrect password.
fr: Mot de passe incorrect.

source: Invalid or expired code
fr: Code invalide ou périmé

source: No such email in the database.
fr: Cette adresse e-mail n'existe pas dans la base de donnée.

source: No such user.
fr: Utilisateur non trouvé.

source: No user account matches this user id and this authToken.
fr: Aucun compte utilisateur ne correspond à cet id utilisateur et à cet authToken.

source: Password is not set for this user.
fr: Aucun mot de passe n'a été défini pour cet utilisateur.

source: Password reset
fr: Réinitialisation du mot de passe

source: Password too easy to guess.
fr: Mot de passe trop facile à deviner.

source: Registration
fr: Inscription

source: The password verification failed because of a server side issue.
fr: La vérification du mot de passe a échoué en raison d'un problème côté serveur.

source: This email address already belongs to a registered account.
fr: Cette adresse e-mail appartient déjà à un compte utilisateur.

source: This is already the email address of this account.
fr: C'est déjà l'adresse e-mail de ce compte utilisateur.

source: This is the same password as the current one.
fr: C'est le même mot de passe que le mot de passe actuel.

source: This user didn't register via email.
fr: Cet utilisateur ne s'est pas enregistré par e-mail.

source: This user isn't active.
fr: Ce compte utilisateur n'est pas actif.

source: Unrecognized authToken.
fr: authToken non reconnu.

source: Validation of your new email address
fr: Confirmation de votre nouvelle adresse e-mail

source: _id, email and emailLower are read only.
fr: _id, email, et emailLower sont en lecture seule.
